const StartMatrix = [
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0]
]

// const StartMatrix = [
//     [0, 0, 0],
//     [0, 0, 0],
//     [0, 0, 0],
//     [0, 0, 0],
//     [0, 0, 0],
//     [0, 0, 0]
// ]

const Classes = ["танк", "экскаватор", "грейдер", "бронетранспортер", "кран гусеничный", "самосвал", "бульдозер", "погрузчик"]
const Concents = ["пушка", "башня", "гусеницы", "ковш", "колеса", "броня", "отвал", "подъемник", "кабина", "кузов"]
const Syndroms = [
    [1, 1, 1, 0, 0, 1, 0, 0, 0, 0],
    [0, 0, 1, 1, 0, 0, 0, 0, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 0, 1, 0],
    [1, 0, 0, 0, 1, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 0, 0, 1, 1],
    [0, 0, 1, 0, 0, 0, 1, 0, 1, 0],
    [0, 0, 0, 0, 1, 0, 0, 1, 0, 0]
    //[0, 1, 0, 0, 1, 0, 0, 1, 1, 0]
]

// const Classes = ["Птица", "Самолет", "Планер"]
// const Concents = ["Крылья", "Хвост", "Клюв", "Двигатель", "Оперение", "Шасси"]
// const Syndroms = [
//     [1, 1, 1, 0, 1, 0],
//     [1, 1, 0, 1, 0, 1],
//     [1, 1, 0, 0, 0, 0]
// ]


export {StartMatrix, Concents, Classes, Syndroms};